Revit 2026 API

# ColorFillSchemeEntrySetDoubleValue Method

---

Sets new Double value of entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetDoubleValue(
	double value
)
```
```vb
Public Sub SetDoubleValue (
	value As Double
)
```
```cpp
public:
void SetDoubleValue(
	double value
)
```
```fsharp
member SetDoubleValue :
        value : float -> unit
```

#### Parameters

value Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The entry has different storage type with Double, or value is not finite. |

You should only use this method if the StorageType property reports the type of the entry as a Double.

#### Reference

ColorFillSchemeEntry Class

Autodesk.Revit.DB Namespace